cmsis-svd/cmsis-svd/data/Atmel/ATSAML22G16A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORT</name>
      <version>2.1.1</version>
      <description>Port Module</description>
      <groupName>PORT</groupName>
      <prependToName>PORT_</prependToName>
      <baseAddress>0x41006000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>DIR%s</name>
          <description>Data Direction</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>DIRCLR%s</name>
          <description>Data Direction Clear</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>DIRSET%s</name>
          <description>Data Direction Set</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>DIRTGL%s</name>
          <description>Data Direction Toggle</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>OUT%s</name>
          <description>Data Output Value</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>OUTCLR%s</name>
          <description>Data Output Value Clear</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>OUTSET%s</name>
          <description>Data Output Value Set</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>OUTTGL%s</name>
          <description>Data Output Value Toggle</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>IN%s</name>
          <description>Data Input Value</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>CTRL%s</name>
          <description>Control</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SAMPLING</name>
              <description>Input Sampling Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>WRCONFIG%s</name>
          <description>Write Configuration</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PINMASK</name>
              <description>Pin Mask for Multiple Pin Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PMUXEN</name>
              <description>Select Peripheral Multiplexer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INEN</name>
              <description>Input Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PULLEN</name>
              <description>Pull Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRVSTR</name>
              <description>Output Driver Strength Selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMUX</name>
              <description>Peripheral Multiplexing Template</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WRPMUX</name>
              <description>Write PMUX Registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRPINCFG</name>
              <description>Write PINCFG Registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HWSEL</name>
              <description>Half-Word Select</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>EVCTRL%s</name>
          <description>Event Input Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PID0</name>
              <description>Port Event Pin Identifier 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>EVACT0</name>
              <description>Port Event Action 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PORTEI0</name>
              <description>Port Event Enable Input 0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID1</name>
              <description>Port Event Pin Identifier 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>EVACT1</name>
              <description>Port Event Action 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PORTEI1</name>
              <description>Port Event Enable Input 1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID2</name>
              <description>Port Event Pin Identifier 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>EVACT2</name>
              <description>Port Event Action 2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PORTEI2</name>
              <description>Port Event Enable Input 2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID3</name>
              <description>Port Event Pin Identifier 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>EVACT3</name>
              <description>Port Event Action 3</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PORTEI3</name>
              <description>Port Event Enable Input 3</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PMUX0_%s</name>
          <description>Peripheral Multiplexing n - Group 0</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PMUXE</name>
              <description>Peripheral Multiplexing for Even-Numbered Pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PMUXO</name>
              <description>Peripheral Multiplexing for Odd-Numbered Pin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register derivedFrom="PMUX0_%s">
          <dim>16</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PMUX1_%s</name>
          <description>Peripheral Multiplexing n - Group 1</description>
          <addressOffset>0xb0</addressOffset>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PINCFG0_%s</name>
          <description>Pin Configuration n - Group 0</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PMUXEN</name>
              <description>Select Peripheral Multiplexer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INEN</name>
              <description>Input Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PULLEN</name>
              <description>Pull Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRVSTR</name>
              <description>Output Driver Strength Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
