cmsis-svd/cmsis-svd/data/Atmel/ATSAML22G16A.svd
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTRLD</name>
              <description>Control D</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FC0</name>
          <description>Frame Counter 0 Configuration</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>Frame Counter Overflow Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PB</name>
              <description>Prescaler Bypass</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FC1</name>
          <description>Frame Counter 1 Configuration</description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>Frame Counter Overflow Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PB</name>
              <description>Prescaler Bypass</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FC2</name>
          <description>Frame Counter 2 Configuration</description>
          <addressOffset>0x1A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>Frame Counter Overflow Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PB</name>
              <description>Prescaler Bypass</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LPENL</name>
          <description>LCD Pin Enable Low</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPEN</name>
              <description>LCD Pin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LPENH</name>
          <description>LCD Pin Enable High</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPEN</name>
              <description>LCD Pin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAL0</name>
          <description>Segments Data Low for COM0 Line</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAH0</name>
          <description>Segments Data High for COM0 Line</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAL1</name>
          <description>Segments Data Low for COM1 Line</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAH1</name>
          <description>Segments Data High for COM1 Line</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAL2</name>
          <description>Segments Data Low for COM2 Line</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAH2</name>
          <description>Segments Data High for COM2 Line</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAL3</name>
          <description>Segments Data Low for COM3 Line</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAH3</name>
          <description>Segments Data High for COM3 Line</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAL4</name>
          <description>Segments Data Low for COM4 Line</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAH4</name>
          <description>Segments Data High for COM4 Line</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAL5</name>
          <description>Segments Data Low for COM5 Line</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAH5</name>
          <description>Segments Data High for COM5 Line</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAL6</name>
          <description>Segments Data Low for COM6 Line</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAH6</name>
          <description>Segments Data High for COM6 Line</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAL7</name>
          <description>Segments Data Low for COM7 Line</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATAH7</name>
          <description>Segments Data High for COM7 Line</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISDATA</name>
          <description>Indirect Segments Data Access</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SDMASK</name>
              <description>Segments Data Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>OFF</name>
              <description>Byte Offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCFG</name>
          <description>Blink Configuration</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Blinking Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>BLINKALL</name>
                  <description>Blink all segments</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLINKSEL</name>
                  <description>Blink selected segments</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCS</name>
              <description>Frame Counter Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>FCSSelect</name>
                <enumeratedValue>
                  <name>FC0</name>
                  <description>Frame Counter 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC1</name>
                  <description>Frame Counter 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC2</name>
                  <description>Frame Counter 2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSS0</name>
              <description>Blink Segment Selection 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BSS1</name>
              <description>Blink Segment Selection 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRCFG</name>
          <description>Circular Shift Register Configuration</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIR</name>
              <description>Direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCS</name>
              <description>Frame Counter Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>FCSSelect</name>
                <enumeratedValue>
                  <name>FC0</name>
                  <description>Frame Counter 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC1</name>
                  <description>Frame Counter 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC2</name>
                  <description>Frame Counter 2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Circular Shift Register Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATA</name>
              <description>Circular Shift Register Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMCFG</name>
          <description>Character Mapping Configuration</description>
          <addressOffset>0x70</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>NSEG</name>
              <description>Number of SEG lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DEC</name>
              <description>Decrement SEG Line Index</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACMCFG</name>
          <description>Automated Character Mapping Configuration</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NCOM</name>
              <description>COM Lines per Row</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>NDIG</name>
              <description>Number of Digit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STEPS</name>
              <description>Scrolling Steps</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>NDROW</name>
              <description>Number of Digit per Row</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>SEQ</name>
                  <description>Sequential Display Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCROLL</name>
                  <description>Scrolling Display Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEG</name>
              <description>Start SEG Line</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>FCS</name>
              <description>Frame Counter Selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>FCSSelect</name>
                <enumeratedValue>
                  <name>FC0</name>
                  <description>Frame Counter 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC1</name>
                  <description>Frame Counter 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC2</name>
                  <description>Frame Counter 2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ABMCFG</name>
          <description>Automated Bit Mapping Configuration</description>
          <addressOffset>0x78</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FCS</name>
              <description>Frame Counter Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>FCSSelect</name>
                <enumeratedValue>
                  <name>FC0</name>
                  <description>Frame Counter 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC1</name>
                  <description>Frame Counter 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC2</name>
                  <description>Frame Counter 2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Size</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDATA</name>
          <description>Character Mapping Segments Data</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Segments Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDMASK</name>
          <description>Character Mapping Segments Data Mask</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDMASK</name>
              <description>Segments Data Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMINDEX</name>
          <description>Character Mapping SEG/COM Index</description>
          <addressOffset>0x84</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SINDEX</name>
              <description>SEG Line Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CINDEX</name>
              <description>COM Line Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
